Tekla.Structures.Drawing.GraphicObjectHatchAttributes
The GraphicObjectHatchAttributes class contains hatch attributes for graphic object hatches.

Tekla.Structures.Drawing.GraphicObjectHatchAttributes.OffsetX
The offset from the origin in the X-direction.

Tekla.Structures.Drawing.GraphicObjectHatchAttributes.OffsetY
The offset from the origin in the Y-direction.

Tekla.Structures.Drawing.GraphicObjectHatchAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.